@ECHO OFF
REM ####################################################################################################
REM #処理概要
REM # タスクスケジューラーで自動実行し、batch_test9.batを9999回繰り返す。
REM #引数
REM #  なし
REM #入力ファイル
REM #  C:\Work\batch_test9.bat
REM #戻り値
REM #  0 正常終了
REM #  1 異常終了
REM #出力ファイル
REM #  無し
REM ####################################################################################################


REM 9999回繰り返す処理
for /l %%n in (1,1,9999) do (
    REM batch_test9.batを呼び出す
    call %~dp0batch_test9.bat

    REM 15分スリーブさせる
    ping -n 3 127.0.0.1>nul
)

exit /b 0
REM ####################################################################################################
REM #参考サイト一覧
REM #スリーブの仕方：https://www.delftstack.com/ja/howto/batch/how-to-sleep-or-wait-x-seconds-in-a-bat-file/

REM ####################################################################################################